In [1]:
people = {
    'first':['Corey','Jane','John'],
    'last':['Schafer','Doe','Doe'],
    'email':['CoreyMSchafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com'],
    
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name','last_name','email']

In [7]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = df.columns.str.replace(' ','_')

In [10]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [11]:
df.rename(columns = {'first_name':'first','last_name':'last'})

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [12]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [13]:
df.rename(columns = {'first_name':'first','last_name':'last'}, inplace=True)

In [14]:
df.loc[2] = ['John','Smith','JohnSmith@email.com']

In [15]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [16]:
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']

In [17]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [18]:
df.loc[2,'last'] = 'Smith'

In [19]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [20]:
df.at[2,'last'] = 'Doe'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [21]:
 filt =(df['email']=='JohnDoe@email.com')
df[filt]['last'] = 'Smith'

<ipython-input-21-7511566fa73f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith'

In [22]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [23]:
filt =(df['email']=='JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [24]:
df['email'] = df['email'].str.lower()

In [25]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

#### 1.apply 
#### 2.map
#### 3.applymap
#### 4.replace

In [26]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [27]:
def update_email(email):
    return email.upper()

In [30]:
df['email'] = df['email'].apply(update_email)

In [31]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [32]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [33]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [34]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [36]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [37]:
len(df['email'])

3

In [38]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [39]:
df.apply(lambda x : x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [40]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [42]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [43]:
df['first'].map({'Corey':'Chris', 'Jane':'Mary'}) # 해당되는 값들은 변경시키고 선택하지 않은 값들은 NaN으로 값을 돌려주게됨

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [47]:
df['first'] = df['first'].replace({'Corey':'Chris', 'Jane':'Mary'}) # 해당되는 값들은 변경시키고 선택하지 않은 값들은 기존 값으로 그대로둠

In [48]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com